mchpgfx/example_projects/GFX_Sim_NumericKeypad/firmware/src/packs/ATSAMA5D21_DFP/pio/sama5d21.h
#define PIO_PA19E_SDMMC1_DAT1                      (_UINT32_(1) << 19) /**< SDMMC1 signal: SDMMC1_DAT1 */
#define PIN_PA20E_SDMMC1_DAT2                      _UINT32_(20) /**< SDMMC1 signal: SDMMC1_DAT2 on PA20 mux E */
#define MUX_PA20E_SDMMC1_DAT2                      _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_DAT2 */
#define PIO_PA20E_SDMMC1_DAT2                      (_UINT32_(1) << 20) /**< SDMMC1 signal: SDMMC1_DAT2 */
#define PIN_PA21E_SDMMC1_DAT3                      _UINT32_(21) /**< SDMMC1 signal: SDMMC1_DAT3 on PA21 mux E */
#define MUX_PA21E_SDMMC1_DAT3                      _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_DAT3 */
#define PIO_PA21E_SDMMC1_DAT3                      (_UINT32_(1) << 21) /**< SDMMC1 signal: SDMMC1_DAT3 */
#define PIN_PA27E_SDMMC1_RSTN                      _UINT32_(27) /**< SDMMC1 signal: SDMMC1_RSTN on PA27 mux E */
#define MUX_PA27E_SDMMC1_RSTN                      _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_RSTN */
#define PIO_PA27E_SDMMC1_RSTN                      (_UINT32_(1) << 27) /**< SDMMC1 signal: SDMMC1_RSTN */
#define PIN_PA29E_SDMMC1_WP                        _UINT32_(29) /**< SDMMC1 signal: SDMMC1_WP on PA29 mux E */
#define MUX_PA29E_SDMMC1_WP                        _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_WP */
#define PIO_PA29E_SDMMC1_WP                        (_UINT32_(1) << 29) /**< SDMMC1 signal: SDMMC1_WP */
/* ========== PIO definition for HSMC peripheral ========== */
#define PIN_PB12B_HSMC_A1                          _UINT32_(44) /**< HSMC signal: HSMC_A1 on PB12 mux B */
#define MUX_PB12B_HSMC_A1                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A1 */
#define PIO_PB12B_HSMC_A1                          (_UINT32_(1) << 12) /**< HSMC signal: HSMC_A1 */
#define PIN_PC12C_HSMC_A1                          _UINT32_(76) /**< HSMC signal: HSMC_A1 on PC12 mux C */
#define MUX_PC12C_HSMC_A1                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A1 */
#define PIO_PC12C_HSMC_A1                          (_UINT32_(1) << 12) /**< HSMC signal: HSMC_A1 */
#define PIN_PB13B_HSMC_A2                          _UINT32_(45) /**< HSMC signal: HSMC_A2 on PB13 mux B */
#define MUX_PB13B_HSMC_A2                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A2 */
#define PIO_PB13B_HSMC_A2                          (_UINT32_(1) << 13) /**< HSMC signal: HSMC_A2 */
#define PIN_PC13C_HSMC_A2                          _UINT32_(77) /**< HSMC signal: HSMC_A2 on PC13 mux C */
#define MUX_PC13C_HSMC_A2                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A2 */
#define PIO_PC13C_HSMC_A2                          (_UINT32_(1) << 13) /**< HSMC signal: HSMC_A2 */
#define PIN_PB14B_HSMC_A3                          _UINT32_(46) /**< HSMC signal: HSMC_A3 on PB14 mux B */
#define MUX_PB14B_HSMC_A3                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A3 */
#define PIO_PB14B_HSMC_A3                          (_UINT32_(1) << 14) /**< HSMC signal: HSMC_A3 */
#define PIN_PC14C_HSMC_A3                          _UINT32_(78) /**< HSMC signal: HSMC_A3 on PC14 mux C */
#define MUX_PC14C_HSMC_A3                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A3 */
#define PIO_PC14C_HSMC_A3                          (_UINT32_(1) << 14) /**< HSMC signal: HSMC_A3 */
#define PIN_PB15B_HSMC_A4                          _UINT32_(47) /**< HSMC signal: HSMC_A4 on PB15 mux B */
#define MUX_PB15B_HSMC_A4                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A4 */
#define PIO_PB15B_HSMC_A4                          (_UINT32_(1) << 15) /**< HSMC signal: HSMC_A4 */
#define PIN_PC15C_HSMC_A4                          _UINT32_(79) /**< HSMC signal: HSMC_A4 on PC15 mux C */
#define MUX_PC15C_HSMC_A4                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A4 */
#define PIO_PC15C_HSMC_A4                          (_UINT32_(1) << 15) /**< HSMC signal: HSMC_A4 */
#define PIN_PB16B_HSMC_A5                          _UINT32_(48) /**< HSMC signal: HSMC_A5 on PB16 mux B */
#define MUX_PB16B_HSMC_A5                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A5 */
#define PIO_PB16B_HSMC_A5                          (_UINT32_(1) << 16) /**< HSMC signal: HSMC_A5 */
#define PIN_PC16C_HSMC_A5                          _UINT32_(80) /**< HSMC signal: HSMC_A5 on PC16 mux C */
#define MUX_PC16C_HSMC_A5                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A5 */
#define PIO_PC16C_HSMC_A5                          (_UINT32_(1) << 16) /**< HSMC signal: HSMC_A5 */
#define PIN_PB17B_HSMC_A6                          _UINT32_(49) /**< HSMC signal: HSMC_A6 on PB17 mux B */
#define MUX_PB17B_HSMC_A6                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A6 */
#define PIO_PB17B_HSMC_A6                          (_UINT32_(1) << 17) /**< HSMC signal: HSMC_A6 */
#define PIN_PC17C_HSMC_A6                          _UINT32_(81) /**< HSMC signal: HSMC_A6 on PC17 mux C */
#define MUX_PC17C_HSMC_A6                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A6 */
#define PIO_PC17C_HSMC_A6                          (_UINT32_(1) << 17) /**< HSMC signal: HSMC_A6 */
#define PIN_PB18B_HSMC_A7                          _UINT32_(50) /**< HSMC signal: HSMC_A7 on PB18 mux B */
#define MUX_PB18B_HSMC_A7                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A7 */
#define PIO_PB18B_HSMC_A7                          (_UINT32_(1) << 18) /**< HSMC signal: HSMC_A7 */
#define PIN_PC18C_HSMC_A7                          _UINT32_(82) /**< HSMC signal: HSMC_A7 on PC18 mux C */
#define MUX_PC18C_HSMC_A7                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A7 */
#define PIO_PC18C_HSMC_A7                          (_UINT32_(1) << 18) /**< HSMC signal: HSMC_A7 */
#define PIN_PB19B_HSMC_A8                          _UINT32_(51) /**< HSMC signal: HSMC_A8 on PB19 mux B */
#define MUX_PB19B_HSMC_A8                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A8 */
#define PIO_PB19B_HSMC_A8                          (_UINT32_(1) << 19) /**< HSMC signal: HSMC_A8 */
#define PIN_PC19C_HSMC_A8                          _UINT32_(83) /**< HSMC signal: HSMC_A8 on PC19 mux C */
#define MUX_PC19C_HSMC_A8                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A8 */
#define PIO_PC19C_HSMC_A8                          (_UINT32_(1) << 19) /**< HSMC signal: HSMC_A8 */
#define PIN_PB20B_HSMC_A9                          _UINT32_(52) /**< HSMC signal: HSMC_A9 on PB20 mux B */
#define MUX_PB20B_HSMC_A9                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A9 */
#define PIO_PB20B_HSMC_A9                          (_UINT32_(1) << 20) /**< HSMC signal: HSMC_A9 */
#define PIN_PC20C_HSMC_A9                          _UINT32_(84) /**< HSMC signal: HSMC_A9 on PC20 mux C */
#define MUX_PC20C_HSMC_A9                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A9 */
#define PIO_PC20C_HSMC_A9                          (_UINT32_(1) << 20) /**< HSMC signal: HSMC_A9 */
#define PIN_PB21B_HSMC_A10                         _UINT32_(53) /**< HSMC signal: HSMC_A10 on PB21 mux B */
#define MUX_PB21B_HSMC_A10                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A10 */
#define PIO_PB21B_HSMC_A10                         (_UINT32_(1) << 21) /**< HSMC signal: HSMC_A10 */
#define PIN_PC21C_HSMC_A10                         _UINT32_(85) /**< HSMC signal: HSMC_A10 on PC21 mux C */
#define MUX_PC21C_HSMC_A10                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A10 */
#define PIO_PC21C_HSMC_A10                         (_UINT32_(1) << 21) /**< HSMC signal: HSMC_A10 */
#define PIN_PB22B_HSMC_A11                         _UINT32_(54) /**< HSMC signal: HSMC_A11 on PB22 mux B */
#define MUX_PB22B_HSMC_A11                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A11 */
#define PIO_PB22B_HSMC_A11                         (_UINT32_(1) << 22) /**< HSMC signal: HSMC_A11 */
#define PIN_PC22C_HSMC_A11                         _UINT32_(86) /**< HSMC signal: HSMC_A11 on PC22 mux C */
#define MUX_PC22C_HSMC_A11                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A11 */
#define PIO_PC22C_HSMC_A11                         (_UINT32_(1) << 22) /**< HSMC signal: HSMC_A11 */
#define PIN_PB23B_HSMC_A12                         _UINT32_(55) /**< HSMC signal: HSMC_A12 on PB23 mux B */
#define MUX_PB23B_HSMC_A12                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A12 */
#define PIO_PB23B_HSMC_A12                         (_UINT32_(1) << 23) /**< HSMC signal: HSMC_A12 */
#define PIN_PC23C_HSMC_A12                         _UINT32_(87) /**< HSMC signal: HSMC_A12 on PC23 mux C */
#define MUX_PC23C_HSMC_A12                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A12 */
#define PIO_PC23C_HSMC_A12                         (_UINT32_(1) << 23) /**< HSMC signal: HSMC_A12 */
#define PIN_PB24B_HSMC_A13                         _UINT32_(56) /**< HSMC signal: HSMC_A13 on PB24 mux B */
#define MUX_PB24B_HSMC_A13                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A13 */
#define PIO_PB24B_HSMC_A13                         (_UINT32_(1) << 24) /**< HSMC signal: HSMC_A13 */
#define PIN_PC24C_HSMC_A13                         _UINT32_(88) /**< HSMC signal: HSMC_A13 on PC24 mux C */
#define MUX_PC24C_HSMC_A13                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A13 */
#define PIO_PC24C_HSMC_A13                         (_UINT32_(1) << 24) /**< HSMC signal: HSMC_A13 */
#define PIN_PB25B_HSMC_A14                         _UINT32_(57) /**< HSMC signal: HSMC_A14 on PB25 mux B */
#define MUX_PB25B_HSMC_A14                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A14 */
#define PIO_PB25B_HSMC_A14                         (_UINT32_(1) << 25) /**< HSMC signal: HSMC_A14 */
#define PIN_PC25C_HSMC_A14                         _UINT32_(89) /**< HSMC signal: HSMC_A14 on PC25 mux C */
#define MUX_PC25C_HSMC_A14                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A14 */
#define PIO_PC25C_HSMC_A14                         (_UINT32_(1) << 25) /**< HSMC signal: HSMC_A14 */
#define PIN_PB26B_HSMC_A15                         _UINT32_(58) /**< HSMC signal: HSMC_A15 on PB26 mux B */
#define MUX_PB26B_HSMC_A15                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A15 */
#define PIO_PB26B_HSMC_A15                         (_UINT32_(1) << 26) /**< HSMC signal: HSMC_A15 */
#define PIN_PC26C_HSMC_A15                         _UINT32_(90) /**< HSMC signal: HSMC_A15 on PC26 mux C */
#define MUX_PC26C_HSMC_A15                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A15 */
#define PIO_PC26C_HSMC_A15                         (_UINT32_(1) << 26) /**< HSMC signal: HSMC_A15 */
#define PIN_PB27B_HSMC_A16                         _UINT32_(59) /**< HSMC signal: HSMC_A16 on PB27 mux B */
#define MUX_PB27B_HSMC_A16                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A16 */
#define PIO_PB27B_HSMC_A16                         (_UINT32_(1) << 27) /**< HSMC signal: HSMC_A16 */
#define PIN_PC27C_HSMC_A16                         _UINT32_(91) /**< HSMC signal: HSMC_A16 on PC27 mux C */
#define MUX_PC27C_HSMC_A16                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A16 */
#define PIO_PC27C_HSMC_A16                         (_UINT32_(1) << 27) /**< HSMC signal: HSMC_A16 */
#define PIN_PB28B_HSMC_A17                         _UINT32_(60) /**< HSMC signal: HSMC_A17 on PB28 mux B */
#define MUX_PB28B_HSMC_A17                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A17 */
#define PIO_PB28B_HSMC_A17                         (_UINT32_(1) << 28) /**< HSMC signal: HSMC_A17 */
#define PIN_PC28C_HSMC_A17                         _UINT32_(92) /**< HSMC signal: HSMC_A17 on PC28 mux C */
#define MUX_PC28C_HSMC_A17                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A17 */
#define PIO_PC28C_HSMC_A17                         (_UINT32_(1) << 28) /**< HSMC signal: HSMC_A17 */
#define PIN_PB29B_HSMC_A18                         _UINT32_(61) /**< HSMC signal: HSMC_A18 on PB29 mux B */
#define MUX_PB29B_HSMC_A18                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A18 */
#define PIO_PB29B_HSMC_A18                         (_UINT32_(1) << 29) /**< HSMC signal: HSMC_A18 */
#define PIN_PC29C_HSMC_A18                         _UINT32_(93) /**< HSMC signal: HSMC_A18 on PC29 mux C */
#define MUX_PC29C_HSMC_A18                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A18 */
#define PIO_PC29C_HSMC_A18                         (_UINT32_(1) << 29) /**< HSMC signal: HSMC_A18 */
#define PIN_PB30B_HSMC_A19                         _UINT32_(62) /**< HSMC signal: HSMC_A19 on PB30 mux B */
#define MUX_PB30B_HSMC_A19                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A19 */
#define PIO_PB30B_HSMC_A19                         (_UINT32_(1) << 30) /**< HSMC signal: HSMC_A19 */
#define PIN_PC30C_HSMC_A19                         _UINT32_(94) /**< HSMC signal: HSMC_A19 on PC30 mux C */
#define MUX_PC30C_HSMC_A19                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A19 */
#define PIO_PC30C_HSMC_A19                         (_UINT32_(1) << 30) /**< HSMC signal: HSMC_A19 */
#define PIN_PB31B_HSMC_A20                         _UINT32_(63) /**< HSMC signal: HSMC_A20 on PB31 mux B */
#define MUX_PB31B_HSMC_A20                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A20 */
#define PIO_PB31B_HSMC_A20                         (_UINT32_(1) << 31) /**< HSMC signal: HSMC_A20 */
#define PIN_PC31C_HSMC_A20                         _UINT32_(95) /**< HSMC signal: HSMC_A20 on PC31 mux C */
#define MUX_PC31C_HSMC_A20                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A20 */
#define PIO_PC31C_HSMC_A20                         (_UINT32_(1) << 31) /**< HSMC signal: HSMC_A20 */
#define PIN_PC0B_HSMC_A23                          _UINT32_(64) /**< HSMC signal: HSMC_A23 on PC0 mux B */
#define MUX_PC0B_HSMC_A23                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A23 */
#define PIO_PC0B_HSMC_A23                          (_UINT32_(1) << 0) /**< HSMC signal: HSMC_A23 */
#define PIN_PD0C_HSMC_A23                          _UINT32_(96) /**< HSMC signal: HSMC_A23 on PD0 mux C */
#define MUX_PD0C_HSMC_A23                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A23 */
#define PIO_PD0C_HSMC_A23                          (_UINT32_(1) << 0) /**< HSMC signal: HSMC_A23 */
#define PIN_PC1B_HSMC_A24                          _UINT32_(65) /**< HSMC signal: HSMC_A24 on PC1 mux B */
#define MUX_PC1B_HSMC_A24                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A24 */
#define PIO_PC1B_HSMC_A24                          (_UINT32_(1) << 1) /**< HSMC signal: HSMC_A24 */
#define PIN_PD1C_HSMC_A24                          _UINT32_(97) /**< HSMC signal: HSMC_A24 on PD1 mux C */
#define MUX_PD1C_HSMC_A24                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A24 */
#define PIO_PD1C_HSMC_A24                          (_UINT32_(1) << 1) /**< HSMC signal: HSMC_A24 */
#define PIN_PC2B_HSMC_A25                          _UINT32_(66) /**< HSMC signal: HSMC_A25 on PC2 mux B */
#define MUX_PC2B_HSMC_A25                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A25 */
#define PIO_PC2B_HSMC_A25                          (_UINT32_(1) << 2) /**< HSMC signal: HSMC_A25 */
#define PIN_PD2C_HSMC_A25                          _UINT32_(98) /**< HSMC signal: HSMC_A25 on PD2 mux C */
#define MUX_PD2C_HSMC_A25                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A25 */
#define PIO_PD2C_HSMC_A25                          (_UINT32_(1) << 2) /**< HSMC signal: HSMC_A25 */
#define PIN_PB11B_HSMC_A0                          _UINT32_(43) /**< HSMC signal: HSMC_A0 on PB11 mux B */
#define MUX_PB11B_HSMC_A0                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A0 */
#define PIO_PB11B_HSMC_A0                          (_UINT32_(1) << 11) /**< HSMC signal: HSMC_A0 */
#define PIN_PC11F_HSMC_A0                          _UINT32_(75) /**< HSMC signal: HSMC_A0 on PC11 mux F */
#define MUX_PC11F_HSMC_A0                          _UINT32_(5)  /**< HSMC signal line function value: HSMC_A0 */
#define PIO_PC11F_HSMC_A0                          (_UINT32_(1) << 11) /**< HSMC signal: HSMC_A0 */
#define PIN_PA10F_HSMC_A21                         _UINT32_(10) /**< HSMC signal: HSMC_A21 on PA10 mux F */
#define MUX_PA10F_HSMC_A21                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_A21 */
#define PIO_PA10F_HSMC_A21                         (_UINT32_(1) << 10) /**< HSMC signal: HSMC_A21 */
#define PIN_PB0B_HSMC_A21                          _UINT32_(32) /**< HSMC signal: HSMC_A21 on PB0 mux B */
#define MUX_PB0B_HSMC_A21                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A21 */
#define PIO_PB0B_HSMC_A21                          (_UINT32_(1) << 0) /**< HSMC signal: HSMC_A21 */
#define PIN_PA11F_HSMC_A22                         _UINT32_(11) /**< HSMC signal: HSMC_A22 on PA11 mux F */
#define MUX_PA11F_HSMC_A22                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_A22 */
#define PIO_PA11F_HSMC_A22                         (_UINT32_(1) << 11) /**< HSMC signal: HSMC_A22 */
#define PIN_PB1B_HSMC_A22                          _UINT32_(33) /**< HSMC signal: HSMC_A22 on PB1 mux B */
#define MUX_PB1B_HSMC_A22                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A22 */
#define PIO_PB1B_HSMC_A22                          (_UINT32_(1) << 1) /**< HSMC signal: HSMC_A22 */
#define PIN_PA0F_HSMC_D0                           _UINT32_(0)  /**< HSMC signal: HSMC_D0 on PA0 mux F */
#define MUX_PA0F_HSMC_D0                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D0 */
#define PIO_PA0F_HSMC_D0                           (_UINT32_(1) << 0) /**< HSMC signal: HSMC_D0 */
#define PIN_PA22B_HSMC_D0                          _UINT32_(22) /**< HSMC signal: HSMC_D0 on PA22 mux B */
#define MUX_PA22B_HSMC_D0                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D0 */
#define PIO_PA22B_HSMC_D0                          (_UINT32_(1) << 22) /**< HSMC signal: HSMC_D0 */
#define PIN_PA1F_HSMC_D1                           _UINT32_(1)  /**< HSMC signal: HSMC_D1 on PA1 mux F */
#define MUX_PA1F_HSMC_D1                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D1 */
#define PIO_PA1F_HSMC_D1                           (_UINT32_(1) << 1) /**< HSMC signal: HSMC_D1 */
#define PIN_PA23B_HSMC_D1                          _UINT32_(23) /**< HSMC signal: HSMC_D1 on PA23 mux B */
#define MUX_PA23B_HSMC_D1                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D1 */
#define PIO_PA23B_HSMC_D1                          (_UINT32_(1) << 23) /**< HSMC signal: HSMC_D1 */
#define PIN_PA2F_HSMC_D2                           _UINT32_(2)  /**< HSMC signal: HSMC_D2 on PA2 mux F */
#define MUX_PA2F_HSMC_D2                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D2 */
#define PIO_PA2F_HSMC_D2                           (_UINT32_(1) << 2) /**< HSMC signal: HSMC_D2 */
#define PIN_PA24B_HSMC_D2                          _UINT32_(24) /**< HSMC signal: HSMC_D2 on PA24 mux B */
#define MUX_PA24B_HSMC_D2                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D2 */
#define PIO_PA24B_HSMC_D2                          (_UINT32_(1) << 24) /**< HSMC signal: HSMC_D2 */
#define PIN_PA3F_HSMC_D3                           _UINT32_(3)  /**< HSMC signal: HSMC_D3 on PA3 mux F */
#define MUX_PA3F_HSMC_D3                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D3 */
#define PIO_PA3F_HSMC_D3                           (_UINT32_(1) << 3) /**< HSMC signal: HSMC_D3 */
#define PIN_PA25B_HSMC_D3                          _UINT32_(25) /**< HSMC signal: HSMC_D3 on PA25 mux B */
#define MUX_PA25B_HSMC_D3                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D3 */
#define PIO_PA25B_HSMC_D3                          (_UINT32_(1) << 25) /**< HSMC signal: HSMC_D3 */
#define PIN_PA4F_HSMC_D4                           _UINT32_(4)  /**< HSMC signal: HSMC_D4 on PA4 mux F */
#define MUX_PA4F_HSMC_D4                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D4 */
#define PIO_PA4F_HSMC_D4                           (_UINT32_(1) << 4) /**< HSMC signal: HSMC_D4 */
#define PIN_PA26B_HSMC_D4                          _UINT32_(26) /**< HSMC signal: HSMC_D4 on PA26 mux B */
#define MUX_PA26B_HSMC_D4                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D4 */
#define PIO_PA26B_HSMC_D4                          (_UINT32_(1) << 26) /**< HSMC signal: HSMC_D4 */
#define PIN_PA5F_HSMC_D5                           _UINT32_(5)  /**< HSMC signal: HSMC_D5 on PA5 mux F */
#define MUX_PA5F_HSMC_D5                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D5 */
#define PIO_PA5F_HSMC_D5                           (_UINT32_(1) << 5) /**< HSMC signal: HSMC_D5 */
#define PIN_PA27B_HSMC_D5                          _UINT32_(27) /**< HSMC signal: HSMC_D5 on PA27 mux B */
#define MUX_PA27B_HSMC_D5                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D5 */
#define PIO_PA27B_HSMC_D5                          (_UINT32_(1) << 27) /**< HSMC signal: HSMC_D5 */
#define PIN_PA6F_HSMC_D6                           _UINT32_(6)  /**< HSMC signal: HSMC_D6 on PA6 mux F */
#define MUX_PA6F_HSMC_D6                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D6 */
#define PIO_PA6F_HSMC_D6                           (_UINT32_(1) << 6) /**< HSMC signal: HSMC_D6 */
#define PIN_PA28B_HSMC_D6                          _UINT32_(28) /**< HSMC signal: HSMC_D6 on PA28 mux B */
#define MUX_PA28B_HSMC_D6                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D6 */
#define PIO_PA28B_HSMC_D6                          (_UINT32_(1) << 28) /**< HSMC signal: HSMC_D6 */
#define PIN_PA7F_HSMC_D7                           _UINT32_(7)  /**< HSMC signal: HSMC_D7 on PA7 mux F */
#define MUX_PA7F_HSMC_D7                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D7 */
#define PIO_PA7F_HSMC_D7                           (_UINT32_(1) << 7) /**< HSMC signal: HSMC_D7 */
#define PIN_PA29B_HSMC_D7                          _UINT32_(29) /**< HSMC signal: HSMC_D7 on PA29 mux B */
#define MUX_PA29B_HSMC_D7                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D7 */
#define PIO_PA29B_HSMC_D7                          (_UINT32_(1) << 29) /**< HSMC signal: HSMC_D7 */
#define PIN_PA13F_HSMC_D8                          _UINT32_(13) /**< HSMC signal: HSMC_D8 on PA13 mux F */
#define MUX_PA13F_HSMC_D8                          _UINT32_(5)  /**< HSMC signal line function value: HSMC_D8 */
#define PIO_PA13F_HSMC_D8                          (_UINT32_(1) << 13) /**< HSMC signal: HSMC_D8 */
#define PIN_PB3B_HSMC_D8                           _UINT32_(35) /**< HSMC signal: HSMC_D8 on PB3 mux B */
#define MUX_PB3B_HSMC_D8                           _UINT32_(1)  /**< HSMC signal line function value: HSMC_D8 */
#define PIO_PB3B_HSMC_D8                           (_UINT32_(1) << 3) /**< HSMC signal: HSMC_D8 */
