mchpgfx/example_projects/GFX_Sim_NumericKeypad/firmware/src/packs/ATSAMA5D21_DFP/pio/sama5d21.h
#define MUX_PD19B_TWIHS1_TWD1                      _UINT32_(1)  /**< TWIHS1 signal line function value: TWIHS1_TWD1 */
#define PIO_PD19B_TWIHS1_TWD1                      (_UINT32_(1) << 19) /**< TWIHS1 signal: TWIHS1_TWD1 */
/* ========== PIO definition for UART0 peripheral ========== */
#define PIN_PB26C_UART0_URXD0                      _UINT32_(58) /**< UART0 signal: UART0_URXD0 on PB26 mux C */
#define MUX_PB26C_UART0_URXD0                      _UINT32_(2)  /**< UART0 signal line function value: UART0_URXD0 */
#define PIO_PB26C_UART0_URXD0                      (_UINT32_(1) << 26) /**< UART0 signal: UART0_URXD0 */
#define PIN_PB27C_UART0_UTXD0                      _UINT32_(59) /**< UART0 signal: UART0_UTXD0 on PB27 mux C */
#define MUX_PB27C_UART0_UTXD0                      _UINT32_(2)  /**< UART0 signal line function value: UART0_UTXD0 */
#define PIO_PB27C_UART0_UTXD0                      (_UINT32_(1) << 27) /**< UART0 signal: UART0_UTXD0 */
/* ========== PIO definition for UART1 peripheral ========== */
#define PIN_PC7E_UART1_URXD1                       _UINT32_(71) /**< UART1 signal: UART1_URXD1 on PC7 mux E */
#define MUX_PC7E_UART1_URXD1                       _UINT32_(4)  /**< UART1 signal line function value: UART1_URXD1 */
#define PIO_PC7E_UART1_URXD1                       (_UINT32_(1) << 7) /**< UART1 signal: UART1_URXD1 */
#define PIN_PD2A_UART1_URXD1                       _UINT32_(98) /**< UART1 signal: UART1_URXD1 on PD2 mux A */
#define MUX_PD2A_UART1_URXD1                       _UINT32_(0)  /**< UART1 signal line function value: UART1_URXD1 */
#define PIO_PD2A_UART1_URXD1                       (_UINT32_(1) << 2) /**< UART1 signal: UART1_URXD1 */
#define PIN_PC8E_UART1_UTXD1                       _UINT32_(72) /**< UART1 signal: UART1_UTXD1 on PC8 mux E */
#define MUX_PC8E_UART1_UTXD1                       _UINT32_(4)  /**< UART1 signal line function value: UART1_UTXD1 */
#define PIO_PC8E_UART1_UTXD1                       (_UINT32_(1) << 8) /**< UART1 signal: UART1_UTXD1 */
#define PIN_PD3A_UART1_UTXD1                       _UINT32_(99) /**< UART1 signal: UART1_UTXD1 on PD3 mux A */
#define MUX_PD3A_UART1_UTXD1                       _UINT32_(0)  /**< UART1 signal line function value: UART1_UTXD1 */
#define PIO_PD3A_UART1_UTXD1                       (_UINT32_(1) << 3) /**< UART1 signal: UART1_UTXD1 */
/* ========== PIO definition for UART2 peripheral ========== */
#define PIN_PD4B_UART2_URXD2                       _UINT32_(100) /**< UART2 signal: UART2_URXD2 on PD4 mux B */
#define MUX_PD4B_UART2_URXD2                       _UINT32_(1)  /**< UART2 signal line function value: UART2_URXD2 */
#define PIO_PD4B_UART2_URXD2                       (_UINT32_(1) << 4) /**< UART2 signal: UART2_URXD2 */
#define PIN_PD19C_UART2_URXD2                      _UINT32_(115) /**< UART2 signal: UART2_URXD2 on PD19 mux C */
#define MUX_PD19C_UART2_URXD2                      _UINT32_(2)  /**< UART2 signal line function value: UART2_URXD2 */
#define PIO_PD19C_UART2_URXD2                      (_UINT32_(1) << 19) /**< UART2 signal: UART2_URXD2 */
#define PIN_PD23A_UART2_URXD2                      _UINT32_(119) /**< UART2 signal: UART2_URXD2 on PD23 mux A */
#define MUX_PD23A_UART2_URXD2                      _UINT32_(0)  /**< UART2 signal line function value: UART2_URXD2 */
#define PIO_PD23A_UART2_URXD2                      (_UINT32_(1) << 23) /**< UART2 signal: UART2_URXD2 */
#define PIN_PD5B_UART2_UTXD2                       _UINT32_(101) /**< UART2 signal: UART2_UTXD2 on PD5 mux B */
#define MUX_PD5B_UART2_UTXD2                       _UINT32_(1)  /**< UART2 signal line function value: UART2_UTXD2 */
#define PIO_PD5B_UART2_UTXD2                       (_UINT32_(1) << 5) /**< UART2 signal: UART2_UTXD2 */
#define PIN_PD20C_UART2_UTXD2                      _UINT32_(116) /**< UART2 signal: UART2_UTXD2 on PD20 mux C */
#define MUX_PD20C_UART2_UTXD2                      _UINT32_(2)  /**< UART2 signal line function value: UART2_UTXD2 */
#define PIO_PD20C_UART2_UTXD2                      (_UINT32_(1) << 20) /**< UART2 signal: UART2_UTXD2 */
#define PIN_PD24A_UART2_UTXD2                      _UINT32_(120) /**< UART2 signal: UART2_UTXD2 on PD24 mux A */
#define MUX_PD24A_UART2_UTXD2                      _UINT32_(0)  /**< UART2 signal line function value: UART2_UTXD2 */
#define PIO_PD24A_UART2_UTXD2                      (_UINT32_(1) << 24) /**< UART2 signal: UART2_UTXD2 */
/* ========== PIO definition for UART3 peripheral ========== */
#define PIN_PB11C_UART3_URXD3                      _UINT32_(43) /**< UART3 signal: UART3_URXD3 on PB11 mux C */
#define MUX_PB11C_UART3_URXD3                      _UINT32_(2)  /**< UART3 signal line function value: UART3_URXD3 */
#define PIO_PB11C_UART3_URXD3                      (_UINT32_(1) << 11) /**< UART3 signal: UART3_URXD3 */
#define PIN_PC12D_UART3_URXD3                      _UINT32_(76) /**< UART3 signal: UART3_URXD3 on PC12 mux D */
#define MUX_PC12D_UART3_URXD3                      _UINT32_(3)  /**< UART3 signal line function value: UART3_URXD3 */
#define PIO_PC12D_UART3_URXD3                      (_UINT32_(1) << 12) /**< UART3 signal: UART3_URXD3 */
#define PIN_PC31C_UART3_URXD3                      _UINT32_(95) /**< UART3 signal: UART3_URXD3 on PC31 mux C */
#define MUX_PC31C_UART3_URXD3                      _UINT32_(2)  /**< UART3 signal line function value: UART3_URXD3 */
#define PIO_PC31C_UART3_URXD3                      (_UINT32_(1) << 31) /**< UART3 signal: UART3_URXD3 */
#define PIN_PB12C_UART3_UTXD3                      _UINT32_(44) /**< UART3 signal: UART3_UTXD3 on PB12 mux C */
#define MUX_PB12C_UART3_UTXD3                      _UINT32_(2)  /**< UART3 signal line function value: UART3_UTXD3 */
#define PIO_PB12C_UART3_UTXD3                      (_UINT32_(1) << 12) /**< UART3 signal: UART3_UTXD3 */
#define PIN_PC13D_UART3_UTXD3                      _UINT32_(77) /**< UART3 signal: UART3_UTXD3 on PC13 mux D */
#define MUX_PC13D_UART3_UTXD3                      _UINT32_(3)  /**< UART3 signal line function value: UART3_UTXD3 */
#define PIO_PC13D_UART3_UTXD3                      (_UINT32_(1) << 13) /**< UART3 signal: UART3_UTXD3 */
#define PIN_PD0C_UART3_UTXD3                       _UINT32_(96) /**< UART3 signal: UART3_UTXD3 on PD0 mux C */
#define MUX_PD0C_UART3_UTXD3                       _UINT32_(2)  /**< UART3 signal line function value: UART3_UTXD3 */
#define PIO_PD0C_UART3_UTXD3                       (_UINT32_(1) << 0) /**< UART3 signal: UART3_UTXD3 */
/* ========== PIO definition for UART4 peripheral ========== */
#define PIN_PB3A_UART4_URXD4                       _UINT32_(35) /**< UART4 signal: UART4_URXD4 on PB3 mux A */
#define MUX_PB3A_UART4_URXD4                       _UINT32_(0)  /**< UART4 signal line function value: UART4_URXD4 */
#define PIO_PB3A_UART4_URXD4                       (_UINT32_(1) << 3) /**< UART4 signal: UART4_URXD4 */
#define PIN_PB4A_UART4_UTXD4                       _UINT32_(36) /**< UART4 signal: UART4_UTXD4 on PB4 mux A */
#define MUX_PB4A_UART4_UTXD4                       _UINT32_(0)  /**< UART4 signal line function value: UART4_UTXD4 */
#define PIO_PB4A_UART4_UTXD4                       (_UINT32_(1) << 4) /**< UART4 signal: UART4_UTXD4 */

#endif /* _SAMA5D21_GPIO_H_ */

